Revit 2026 API

# TopographySurfaceAddPoints Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
public void AddPoints(
	IList<XYZ> points
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")>
Public Sub AddPoints (
	points As IList(Of XYZ)
)
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")]
void AddPoints(
	IList<XYZ^>^ points
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that TopographySurface elements should be converted to Toposolid elements to enable better editing options.")>]
member AddPoints :
        points : IList<XYZ> -> unit
```

#### Parameters

points IListXYZ

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace